set_property IOSTANDARD LVCMOS33 [get_ports resetn]
set_property IOSTANDARD LVCMOS33 [get_ports PWM1]
set_property IOSTANDARD LVCMOS33 [get_ports clk]
set_property IOSTANDARD LVCMOS33 [get_ports PWM2]
set_property IOSTANDARD LVCMOS33 [get_ports PWM3]
set_property PACKAGE_PIN C2 [get_ports resetn]
set_property PACKAGE_PIN E3 [get_ports clk]
set_property PACKAGE_PIN E16 [get_ports PWM1]
set_property PACKAGE_PIN D15 [get_ports PWM2]
set_property PACKAGE_PIN J18 [get_ports PWM3]

create_clock -period 10.000 -name clk -waveform {0.000 5.000} [get_ports clk]
set_input_delay -clock [get_clocks clk] -min -add_delay 2.000 [get_ports resetn]
set_input_delay -clock [get_clocks clk] -max -add_delay 10.000 [get_ports resetn]
set_output_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports PWM1]
set_output_delay -clock [get_clocks clk] -max -add_delay 2.000 [get_ports PWM1]
set_output_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports PWM2]
set_output_delay -clock [get_clocks clk] -max -add_delay 2.000 [get_ports PWM2]
set_output_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports PWM3]
set_output_delay -clock [get_clocks clk] -max -add_delay 2.000 [get_ports PWM3]
